export const reviews = [
{

  "role": "frontend",
  "comments": [
    {
      "reviewer_id": "이주영",
      "projects": ["Code Maestro", "니모를 찾아서"],
      "review_content": "웅이와 함께 프론트엔드를 맡으면서 업무적으로 접점이 많았는데 모르는 부분을 물어보면 항상 잘 알려주고 귀찮은 일도 내색없이 잘 해결해줘서 많은 도움이 되었습니다. 웅이 덕분에 많이 배울 수 있었고 같이 프로젝트를 진행하며 협업 태도나 책임감 면에서 본받을 점도 많았습니다. 항상 저한테 든든하고 팀원으로서 매우 좋은 사람이었다고 생각합니다!",
      "additional_comments": "웅이 항상 고마웠어~~ 싸피 끝나도 가끔 연락해야행~~!"
    },
    {
      "reviewer_id": "정보규",
      "projects": ["Code Maestro"],
      "review_content": "아주 믿음직한 팀원이었고 같이 하게되어 너무 맘에 들었고 든든했던 팀원이었습니다. 힘들어도 묵묵히 자신의 일을 수행하는, 보기드문 진주같은 팀원이었습니다. 항상 잘됐으면 하는 동생입니다.",
      "additional_comments": "아주 믿음직한 팀원이었고 같이 하게되어 너무 맘에 들었고 든든했던 팀원이었습니다. 힘들어도 묵묵히 자신의 일을 수행하는, 보기드문 진주같은 팀원이었습니다. 항상 잘됐으면 하는 동생입니다."
    },

  ]},
  {
    "role": "backend",
    "comments": [
      {
        "reviewer_id": "황지원",
        "projects": ["Code Maestro", "니모를 찾아서"],
      "review_content": "저는 2번의 프로젝트에서 백엔드, 편정웅씨는 프론트를 맡았습니다. 백엔드를 API개발하는 과정에서 데이터 형식도 일관성 없이 작성한 부분도 많았을텐데, API 형식에 맞춰 프론트를 유동적으로 변경, 구현해주어서 편했습니다. 그리고 제 요구사항을 잘 알아주어서 협업하는데 기술적으로 정말 많이 배웠습니다.",
      "additional_comments": "웅이의 장점: 개발 지식이 많아서 기술적으로 많이 배웠다!(특히 우리 SSE 기억나니,,웅아,,우리의 추억이야) API 통신에서 백엔드형식에 맞춰 프론트를 수정해줘서 일하는 입장에서 정말 편했다. 아이디어 서칭이나 리소스 등을 잘 찾는거 같아 프로젝트의 질이 높아진거 같다. 웅아 그동안 고생해써 넌 재능이 많은 아이니 성공할꺼야!! 좋은 소식있음 종종연락줘!!"
    },
    {
      "reviewer_id": "김태영",
      "projects": ["Code Maestro"],
      "review_content": "백엔드와 잘 소통하면서 백엔드의 API 상황을 능숙하게 읽고, 이에 개발을 맞춰주려고 해서 정말 편하게 진행했습니다.",
      "additional_comments": "자기 맡은 일을 열심히 하는 친구라고 생각했어요. 믿음직한 프론트엔드라고 생각합니다. 나중에 프로젝트를 할 일이 있으면 꼭 같이하고싶어요."
    },
    {
      "reviewer_id": "조창훈",
      "projects": ["니모를 찾아서", "그랬구나"],
      "review_content": "편정웅 교육생과 프로젝트를 진행하면서, 비전공자와의 협업에 대한 색안경이 없어졌습니다. 맡은 역할에 책임을 다하고 프로젝트를 진행하으며, API 연동 중 발생한 에러들을 그냥 던져주는 역할이 아닌 먼저 FE 쪽에 에러가 발생하였는지 파악을 한 후 백엔드에 보고하여 협업에 이슈가 발생하지 않았습니다. 기회가 된다면 또 다시 프로젝트를 하고 싶습니다.",
      "additional_comments": "DB 구축 및 설계"
    }
  ]},
  {
    "role": "ai",
    "comments": [
      {
        "reviewer_id": "박가연",
      "projects": ["니모를 찾아서"],
      "review_content": "데이터와 AI에 대해 잘 알고 있는 팀원이었기에, 프로젝트 기획 단계에서 다양한 아이디어를 내는 것이 인상적이었습니다. 저는 AI를 담당하면서 학습한 AI 모델이 실제 서비스에 어떻게 적용될지 많이 궁금했습니다. 프론트엔드 담당자로서 사용자 경험을 고려한 UI를 제작해준 덕분에, AI 서비스가 어떤 페이지에서 적용되고 어떤 흐름으로 결과가 나오는지 살펴볼 수 있어서 좋은 경험이었습니다.",
      "additional_comments": "팀장을 맡았는데, 해당 프로젝트에서는 제가 JIRA 관리를 잘 하지 못한 점이 아쉬움으로 남아있습니다. 이런 점에서, JIRA 관리나 커밋을 열심히 하는 모습을 보고 배워야겠다고 생각했습니다. 앞으로도 화이팅!"
    },
    {
      "reviewer_id": "제서윤",
      "projects": ["그랬구나"],
      "review_content": "직접적으로 함께 작업을 해야하는 부분은 거의 없었지만, 회의를 할 때나 다른 분들과 작업하는 모습을 지켜보면서 이번 프로젝트가 원활하게 진행될 수 있었던 큰 원인 중 하나가 정웅님이 팀에서 의사소통이나 개발 작업에 많은 부분을 담당해 주신 덕분이라는 생각이 들었습니다. 오류가 발생했을 때 다른 백엔드 분들과 적극적으로 소통하며 문제를 해결해 나가는 모습을 보면서 프로젝트를 성공적으로 마무리하는데에 정웅님의 공로가 컸다고 느꼈어요. 이번 프로젝트에서 데이터쪽을 담당하시지는 않으셨는데도 기능에서 개선되어야 할 점도 직접 찾아서 알려주기도 하고, 데이터 분석 관련 미팅에도 참석해서 함께 의견을 나누어 주시기도 해서 감사했습니다."
    }
  ]
}   
]

